# ابدأ من صورة Odoo 18 الرسمية
FROM odoo:18

# تحول إلى المستخدم الجذر (root) لتتمكن من تثبيت الحزم
USER root

# -------------------------------------------------------------------
# ⭐️ الإضافة: تثبيت أدوات البناء ومتطلبات بايثون قبل تشغيل pip
# -------------------------------------------------------------------
RUN apt-get update && \
    apt-get install -y --no-install-recommends build-essential python3-dev && \
    rm -rf /var/lib/apt/lists/*
# -------------------------------------------------------------------

# قم بتثبيت qifparse باستخدام pip
RUN pip install qifparse

# ارجع إلى مستخدم odoo الافتراضي
USER odoo
